tap "homebrew/bundle"
# Distributed revision control system
brew "git"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Terminal multiplexer
brew "tmux"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adrianwilczynski.namespace"
vscode "alfredbirk.tailwind-documentation"
vscode "asvetliakov.vscode-neovim"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "BriteSnow.vscode-toggle-quotes"
vscode "burkeholland.simple-react-snippets"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "gurumukhi.selected-lines-count"
vscode "hakcorp.php-awesome-snippets"
vscode "helixquar.randomeverything"
vscode "ionutvmi.path-autocomplete"
vscode "JulianIaquinandi.nvim-ui-modifier"
vscode "KevinRose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "leizongmin.node-module-intellisense"
vscode "liamhammett.inline-parameters"
vscode "mgmcdermott.vscode-language-babel"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscode-dotnet-sdk"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.vscode-typescript-next"
vscode "PKief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.LiveServer"
vscode "rohit-chouhan.sweetalert2-snippet"
vscode "ShortArrow.line-number-deco"
vscode "tonybaloney.vscode-pets"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "VisualStudioExptTeam.vscodeintellicode-completions"
vscode "vscodevim.vim"
vscode "VSpaceCode.whichkey"
vscode "WallabyJs.console-ninja"
vscode "WallabyJs.quokka-vscode"
vscode "xabikos.JavaScriptSnippets"
vscode "zhuangtongfa.material-theme"
vscode "Zignd.html-css-class-completion"
vscode "zobo.php-intellisense"
